import speech_recognition as sr
import webbrowser
import time
from matplotlib import pyplot as plt

recognizer = sr.Recognizer()


def capture_voice_input():
    with sr.Microphone() as source:
        print('Говоріть...')
        audio = recognizer.listen(source)
    return audio


def convert_voice_to_text(audio):
    try:
        text = recognizer.recognize_google(audio, language='uk-UA')
        print('Ви сказали: ' + text)
    except sr.UnknownValueError:
        text = ''
        print('Вибачте, я Вас не розумію.')
    except sr.RequestError as e:
        text = ''
        print('Error; {0}'.format(e))
    return text


def show_picture(file, title):
    img = plt.imread(file)
    plt.imshow(img)
    plt.xlabel(title)
    plt.xticks([])
    plt.yticks([])
    plt.show()


def process_voice_command_info(text):
    if 'вітаю' in text.lower():
        print('Привіт! Запитай в мене про історичні пам’ятки міста Львів, та я розкажу все. Скажи фразу яка містить слово "які"')
    elif 'які' in text.lower():
        print('''
        Ось про які пам’ятки я можу розказати:
        Площа Ринок,
        Міська ратуша,
        Львівський оперний театр,
        Палац Потоцьких,
        Каплиця Боїмів,
        Домініканський собор,
        Бернардинський собор,
        Італійське подвір’я,
        Парк "Високий замок"
        ''')
    elif 'ринок' in text.lower():
        print('''
        Площа Ринок – центр політичного, громадського, культурного 
        і торгового життя міста протягом 500 років, серце Львова, 
        історичний початок європеїзації України.
        Саме тут, у долині ріки Полтви в середині ХІV століття німецькі
        колоністи за дорученням короля Казимира ІІІ започаткували
        класичне європейське місто з класичною ринковою площею. 
        Польський король зводив місто за найдосконалішими тогочасними 
        будівельними технологіями, він запросив для цієї мети ремісників 
        та будівельників з Німеччини. У наступні століття архітектурну 
        досконалість Ринку доповнювали італійські та австрійські архітектори.
        ''')
        show_picture('pictures/1.jpeg', 'Площа Ринок')
    elif 'ратуша' in text.lower():
        print('''
        У Львівській міській ратуші, досі перебуває міська рада Львова, але, 
        можливо, піднятися на самий верх ратуші і оглянути Львів з висоти. 
        ''')
        show_picture('pictures/2.jpeg', 'Міська ратуша')
    elif 'театр' in text.lower():
        print('''
        Львівський Оперний театр – архітектурна перлина Львова у стилі неоренесансу 
        (1901 рік), один з найгарніших театрів Європи. Збудований на початку минулого 
        століття за проектом архітектора Зиґмунта Ґорґолевського Великий театр у Львові 
        порівнювали з Паризькою та Віденською оперою. Стоячи перед величним фасадом цієї 
        фантастичної споруди відчуваєш всепоглинаючу потугу мистецтва, його вічність у 
        контрасті зі швидкоплинністю людського життя. Це споруда, у якій можна знайти 
        різні архітектурні стилі європейських країн, втілені з пишномовною імпозантністю.
        ''')
        show_picture('pictures/3.jpeg', 'Львівський Оперний театр')
    elif 'палац' in text.lower():
        print('''
        За огорожею з орнаментальною металевою брамою бачимо величну і водночас витончену 
        споруду. Імпозантний палац прикрашений рельєфами, ліпниною, настінним живописом і 
        вітражами. Палац Потоцьких – яскравий зразок архiтектури зрiлого iсторизму, одна 
        з найцiкавiших архiтектурних пам’яток Львова. Запроектував його французький 
        архiтектор Луї д'Оверню на замовлення намiсника королiвства Галичини і Лодомерiї 
        графа Альфреда II Юзефа Потоцького (1817-1889). Будівництво тривало від 1888 
        до 1890 року пiд наглядом та деякою коректурою львівського архiтектора Юліана Цибульського.
        ''')
        show_picture('pictures/4.jpeg', 'Палац Потоцьких')
    elif 'каплиця' in text.lower():
        print('''
        Каплиця Боїмів – славнозвісна пам’ятка пізнього ренесансу, яка не має аналогів не лише 
        в Україні, але й у європейській архітектурі. Ця унікальна пам’ятка є окрасою 
        Катедральної площі, з цього провулка відкривається один з найкращих краєвидів Львова 
        на Площу Ринок і міську Ратушу. Львівський купець родом з Угорщини Георгій Боїм 
        розбагатів на торгівлі вином та отримавши громадянство Львова разом з посадою 
        бургомістра вирішив збудувати родинну каплицю небаченої краси. Будівлю звели 
        за проектом вроцлавського будівничого Андрія Бемера і освятили 1615 року.
        ''')
        show_picture('pictures/5.jpeg', 'Каплиця Боїмів')
    elif 'домініканський' in text.lower():
        print('''
        Домініканський собор велична архітектурна пам’ятка пізнього бароко з оригінальним 
        скульптурним оздобленням. Монастир домініканів на цьому місці заснували ще 
        у XIII столітті на прохання дружини українського князя Лева Даниловича, угорської 
        принцеси Констанції, яка була католичкою і на чужині тужила за своєю вірою. 
        Від XV і до середини XVIII століття тут стояв костел, збудований у готичному стилі.
        ''')
        show_picture('pictures/6.jpeg', 'Домініканський собор')
    elif 'бернардинський' in text.lower():
        print('''
        Монастир - пам’ятка ренесансу, маньєризму і бароко 1600-1630 років – цілісний 
        середньовічний монастирський комплекс з фортифікаційними укріпленнями. Пройшовши 
        з боку площі Митної через фортифікаційну браму монастиря – Глинянську вежу 
        нечутними кроками (бо йтимете  унікальною дерев’яною бруківкою), ви потрапляєте 
        на монастирське подвір’я, де кожен з багатьох його закутків дихає старовиною. 
        Все тут завмерло так, ніби й не було останніх чотирьохсот років світової історії.
        ''')
        show_picture('pictures/7.jpeg', 'Бернардинський собор')
    elif 'італійське' in text.lower():
        print('''
        Палац Корнякта – надзвичайно цінна ренесансна пам’ятка 1580 року, палац найбагатшого 
        львів’янина за всю історію міста купця Костянтина Корнякта. Грек за походженням, 
        з острова Крит, Костянтин Корнякт, котрий замешкав у Львові в XVI столітті і 
        контролював торгівлю вином на всьому Чорномор’ї, був меценатом, досвідченим і 
        мудрим чоловіком, знав багато східних мов. Завдяки Корнякту ми тепер насолоджуємось 
        чудовими архітектурними пам’ятками Львова епохи Ренесансу. Цю кам’яницю збудував 
        для нього на місці колишніх двох італійський архітектор Петро Барбон.
        ''')
        show_picture('pictures/8.jpg', 'Італійське подвір’я')
    elif 'парк' in text.lower():
        print('''
        Високий Замок – старий тінистий парк на горі, що височить над містом з руїнами 
        старовинного замку і оглядовим майданчиком з краєвидами, від яких захоплює дух.
        ''')
        show_picture('pictures/9.jpeg', 'Парк "Високий замок"')
    elif "бувай" in text.lower():
        print("До побачення! Гарного дня!")
        return True
    else:
        print("Команда не зрозуміла. Будь ласка спробуйте ще раз.")
    return False


def process_voice_command_route(text):
    if 'вітаю' in text.lower():
        print("Привіт! Спитай у мене як дібратися до пам'ятки міста Львів. Скажи фразу яка містить слово пам'ятки")
    elif "яких" in text.lower():
        print('''
        Ось до яких пам'яток я можу прокласти маршрут:
        Площа Ринок,
        Міська ратуша,
        Львівський оперний театр,
        Палац Потоцьких,
        Каплиця Боїмів,
        Домініканський собор,
        Бернардинський собор,
        Італійське подвір’я,
        Парк "Високий замок"
        ''')
    elif 'ринок' in text.lower():
        print('Відкриваю маршрут до Площі Ринок')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/%D0%BF%D0%BB.+%D0%A0%D1%8B%D0%BD%D0%BE%D0%BA,+%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2,+%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D1%81%D0%BA%D0%B0%D1%8F+%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C,+79000/@49.8413276,24.0315923,17z/data=!3m1!4b1!4m6!3m5!1s0x473add6daee0eb21:0x98a6b79bb05742c2!8m2!3d49.8413276!4d24.0315923!16s%2Fm%2F04y7yfk?entry=ttu')
    elif 'ратуша' in text.lower():
        print('Відкриваю маршрут до Міської ратуші')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9+%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D1%81%D0%BA%D0%BE%D0%B9+%D1%81%D0%BE%D0%B2%D0%B5%D1%82/@49.841607,24.0315099,18.34z/data=!4m20!1m13!4m12!1m3!2m2!1d24.0317391!2d49.8417768!1m6!1m2!1s0x473add6dae655555:0xa71a5e1b2bbc4d64!2z0L_Qu9C-0YnQsCDQoNC40L3QvtC6LCAxLCDQm9GM0LLRltCyLCDQm9GM0LLRltCy0YHRjNC60LAg0L7QsdC70LDRgdGC0YwsIDc5MDA4!2m2!1d24.0316915!2d49.8417366!3e0!3m5!1s0x473add6dae655555:0xa71a5e1b2bbc4d64!8m2!3d49.8417366!4d24.0316915!16s%2Fg%2F119t7fy7f?entry=ttu')
    elif 'театр' in text.lower():
        print('Відкриваю маршрут до Львівського оперного театру')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9+%D0%BD%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9+%D0%B0%D0%BA%D0%B0%D0%B4%D0%B5%D0%BC%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9+%D1%82%D0%B5%D0%B0%D1%82%D1%80+%D0%BE%D0%BF%D0%B5%D1%80%D1%8B+%D0%B8+%D0%B1%D0%B0%D0%BB%D0%B5%D1%82%D0%B0+%D0%B8%D0%BC%D0%B5%D0%BD%D0%B8+%D0%A1%D0%BE%D0%BB%D0%BE%D0%BC%D0%B8%D0%B8+%D0%9A%D1%80%D1%83%D1%88%D0%B5%D0%BB%D1%8C%D0%BD%D0%B8%D1%86%D0%BA%D0%BE%D0%B9/@49.8440167,24.0262123,15z/data=!4m6!3m5!1s0x473add72f9bc6a89:0xf9783fecb4fecf1f!8m2!3d49.8440167!4d24.0262123!16zL20vMGdtYjc5?entry=ttu')
    elif 'палац' in text.lower():
        print('Відкриваю маршрут до Палацу Потоцьких')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/%D0%94%D0%B2%D0%BE%D1%80%D0%B5%D1%86+%D0%9F%D0%BE%D1%82%D0%BE%D1%86%D0%BA%D0%B8%D1%85/@49.8379497,24.0268959,15z/data=!4m2!3m1!1s0x0:0xb8fa7f852817fcdc?sa=X&ved=2ahUKEwjBz5-O1IiDAxUkg_0HHVxUDqUQ_BJ6BAgOEAA')
    elif 'каплиця' in text.lower():
        print('Відкриваю маршрут до Каплиці Боїмів')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/Boim+Chapel/@49.8407083,24.0310645,15z/data=!4m6!3m5!1s0x473add69df8cbbc3:0x55ed8822b7920a9f!8m2!3d49.8407083!4d24.0310645!16s%2Fm%2F027wl7d?entry=ttu')
    elif 'домініканський' in text.lower():
        print('Відкриваю маршрут до Домініканського собору')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/%D0%A6%D0%B5%D1%80%D0%BA%D0%BE%D0%B2%D1%8C+%D0%9F%D1%80%D0%B5%D1%81%D0%B2%D1%8F%D1%82%D0%BE%D0%B9+%D0%95%D0%B2%D1%85%D0%B0%D1%80%D0%B8%D1%81%D1%82%D0%B8%D0%B8/@49.8427498,24.0338232,15z/data=!4m2!3m1!1s0x0:0x97bdfa1e04fc9cc?sa=X&ved=2ahUKEwi7jMPF1IiDAxXN4QIHHb0sCckQ_BJ6BAgQEAA')
    elif 'Бернардинський' in text.lower():
        print('Відкриваю маршрут до Бернардинського собору')
        time.sleep(2)
        webbrowser.open_new('https://www.google.com/maps/place/Bernardine+monastery/@49.8395568,24.0344797,15z/data=!4m2!3m1!1s0x0:0xf98d031cfb204a67?sa=X&ved=2ahUKEwiv4YP31IiDAxUC7QIHHUcdCWYQ_BJ6BAgPEAA')
    elif 'італійське' in text.lower():
        print('Відкриваю маршрут до Італійського подвір’я')
        time.sleep(2)
        webbrowser.open_new('https://google.com/maps/place/%D0%98%D1%82%D0%B0%D0%BB%D1%8C%D1%8F%D0%BD%D1%81%D0%BA%D0%B8%D0%B9+%D0%B4%D0%B2%D0%BE%D1%80%D0%B8%D0%BA/@49.8423151,24.0330272,15z/data=!4m2!3m1!1s0x0:0x73a56de803231767?sa=X&ved=2ahUKEwia2aiN1YiDAxXSzAIHHZ4kBEUQ_BJ6BAgPEAA')
    elif 'парк' in text.lower():
        print('Відкриваю маршрут до Парку "Високий замок"')
        time.sleep(2)
        webbrowser.open_new("https://www.google.com/maps/place/Park-Pam'yatka+%22Vysokyy+Zamok%22/@49.8457063,24.0113486,14.96z/data=!4m6!3m5!1s0x473addaa75911429:0xd9a4d4ea5f95ca11!8m2!3d49.8486329!4d24.0336549!16s%2Fm%2F0w0f13_?entry=ttu")
    elif "бувай" in text.lower():
        print("До побачення! Гарного дня!")
        return True
    else:
        print("Команда не зрозуміла. Будь ласка спробуйте ще раз.")
    return False


def main():
    end_program = False
    print('Оберіть режим роботи:\n')
    print('1 - Коротка відомість про пам’тки')
    print('2 - Показати маршрут до пам’ятки\n')
    mode = int(input('Режим:'))

    while not end_program:
        audio = capture_voice_input()
        text = convert_voice_to_text(audio)
        if mode == 1:
            end_program = process_voice_command_info(text)
        elif mode == 2:
            end_program = process_voice_command_route(text)


if __name__ == "__main__":
    main()
